app/views/search/index.html.erb

    	<div class="floatL userName">
      <%= post.user.first_name %> <%= post.user.last_name %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1


  <% post.likes.each do |like|  %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 1

<% if @not_liked ==0 %>
<a href="#" value="" id="comment" class="comment_like"><%= post.likes.size if post.likes.size > 0 %> Like</a>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1