app/controllers/experiance_controller.rb

INSERT INTO `experiances` (`company`, `country`, `created_at`, `deyear`, `dsyear`, `jeyear`, `job_title`, `jsyear`, `most_recent_company`, `most_recent_job_tile`, `postal_code`, `school_university`, `status`, `updated_at`, `user_id`) VALUES ('hay', 'US', '2013-12-04 06:46:43', 1951, 1951, 1951, 'hay', 1951, '', '', '37000', '', 1, '2013-12-04 06:46:43', 20)
---
  def create
  	@id=current_user.id

   	    	@experiance = Experiance.new(params[:experiance] )




	@experiance.user_id=@id
  	if @experiance.save