app/controllers/search_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
---
def search_result
	@id=current_user.email

		@user=User.find(:all, :conditions => ["email = ?",@id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE (receiver = 'hannan.punjabian@gmail.com' AND status= 1)
---
def search_results


		@user=User.find(:all, :conditions => ["email = ?",current_user.email])


@notifications=Notification.find(:all, :conditions => ["receiver = ? AND status= ?",current_user.email ,1])

UPDATE `users` SET `avatar` = 'DSCN0201__2__g.JPG', `updated_at` = '2013-12-05 03:19:48' WHERE `users`.`id` = 24
SELECT `notifications`.* FROM `notifications` WHERE (user_id = 28 OR status= 1)
---
def profile
    @user = User.new(params[:user])

    current_user.avatar=@user.avatar

    current_user.save!

@notifications=Notification.find(:all, :conditions => ["receiver = ? AND status= ?",current_user.email ,1])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE (userid = 'haha@gmai.com' OR status= 2)
SELECT `notifications`.* FROM `notifications` WHERE (receiver = 'abcd@gmail.com' AND status= 1)
SELECT `friends`.* FROM `friends` WHERE (email = 'hannan.punjabian@gmail.com')
---
def index


		@id=current_user.id
		@user=User.find(:all, :conditions => ["email = ?",@id])


	  	@posts=Post.find(:all, :conditions => ["user_id = ? OR status= ?",@id ,2])


	#@friends=Friend.find(:all, :conditions =>["email = ?",@id])

@notifications=Notification.find(:all, :conditions => ["receiver = ? AND status= ?",current_user.email ,1])




	@friends=Friend.find(:all, :conditions =>["email = ?",current_user.email])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
---
def advance
	@id=current_user.email

		@user=User.find(:all, :conditions => ["email = ?",@id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
INSERT INTO `notifications` (`created_at`, `receiver`, `sender`, `status`, `updated_at`, `user_id`) VALUES ('2013-12-05 07:48:15', 'haha@gmai.com', 'haha@gmai.com', 1, '2013-12-05 07:48:15', 24)
---
	def connect

	@idd=params[:id]

	@user=User.find(params[:id])

	@sender=current_user.id

	 @notify=Notification.new(:sender => @sender, :receiver => @user.email ,:status => 1, :user_id => @user.id)
	  if @notify.save

SELECT `notifications`.* FROM `notifications` WHERE (receiver = 'hannan.punjabian@gmail.com' AND status= 1)
---
	def requests



	@my_id=current_user.id

	@requests=Notification.find(:all,:conditions => ["user_id = ? AND status = ?",@my_id,1])

INSERT INTO `posts` (`body_text`, `created_at`, `status`, `updated_at`, `user_id`) VALUES ('hello', '2013-12-05 01:52:02', 2, '2013-12-05 01:52:02', 24)
---
	def addPost

		@id=current_user.id

	@post=Post.new(:user_id=>@id , :body_text => params[:postText], :status => params[:share])  # status 1 means public



		if @post.save

INSERT INTO `comments` (`comment`, `commenter_id`, `created_at`, `post_id`, `updated_at`) VALUES ('hay hay', 'haha@gmai.com', '2013-12-05 02:04:57', 1, '2013-12-05 02:04:57')
---
	def addComment

	if params[:commentText].length > 0

		@id=current_user.email

		@comment=Comment.new(:commenter_id=>@id , :comment => params[:commentText], :post_id => params[:parent_id])

		if @comment.save

INSERT INTO `likes` (`created_at`, `post_id`, `updated_at`, `user_id`) VALUES ('2013-12-05 02:03:48', 1, '2013-12-05 02:03:48', 1)
---
	def like

		@id=current_user.id

	@like=Like.new(:post_id=> params[:id] , :user_id => @id)  # status 1 means public

		if @like.save

SELECT `users`.* FROM `users` WHERE (email = 'hannan.punjabian@gmail.com')
SELECT `notifications`.* FROM `notifications` WHERE (user_id = 28 OR status= 1)
SELECT `friends`.* FROM `friends` WHERE `friends`.`user_id` = 21
---
def showFriends

@user=User.find(:all, :conditions => ["email = ?",current_user.email])

@user2=@user


@notifications=Notification.find(:all, :conditions => ["receiver = ? AND status= ?",current_user.email ,1])

   current_user.friends.each do |friend|